src/cf/InformationRegisters/РеквизитыПеречисленийПоИсполнительнымЛистам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>РеквизитыПеречисленийПоИсполнительнымЛистам</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ПеречислениеВБюджет</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтатусСоставителя</Name>
					<Comment>поле 101 "Статус плательщика"</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>2</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОчередностьПлатежа</Name>
					<Comment>поле 21 "Очередность платежа"</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КодБК</Name>
					<Comment>поле 104 "КБК"</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КодОКАТО</Name>
					<Comment>поле 105 "ОКТМО"</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>11</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПоказательОснования</Name>
					<Comment>поле 106 "Показатель основания"</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>2</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПоказательПериода</Name>
					<Comment>поле 107 "Показатель периода"</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПоказательНомера</Name>
					<Comment>поле 108 "Показатель номера"</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>18</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПоказательДаты</Name>
					<Comment>поле 109 "Показатель даты"</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НазначениеПлатежа</Name>
					<Comment>поле 24 "Назначение платежа"</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>210</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИдентификаторПлатежа</Name>
					<Comment>поле 22 "Код"</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИсполнительныйЛист</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ИсполнительныйЛист</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/Enums/ВидыГосударственныхОрганов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ВидыГосударственныхОрганов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НалоговыйОрган</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОрганФСС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОрганПФР</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Прочий</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Documents/ИсполнительныйЛист.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Document>
		<Properties>
			<Name>ИсполнительныйЛист</Name>
			<BasedOn>
				<xr:Item>Catalog.Сотрудники</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.УсловияУдержанияПоИсполнительномуДокументу</xr:Item>
				<xr:Item>InformationRegister.ПлановыеУдержания</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФизическоеЛицо</Name>
					<Comment>АПК:58 физлицо является сотрудником</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Получатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаДействия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособРасчета</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыРасчетаУдержанияПоИсполнительномуДокументу</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Процент</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>13</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Числитель</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Знаменатель</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/cf/InformationRegisters/РеквизитыПеречисленийПоИсполнительнымЛистам/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт

	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(Организация)";

КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Функция СтруктураРеквизитов() Экспорт
	
	СтруктураРеквизитов = Новый Структура;
	СтруктураРеквизитов.Вставить("Организация",                        Справочники.Организации.ПустаяСсылка());
	СтруктураРеквизитов.Вставить("Сотрудник",                          Справочники.ФизическиеЛица.ПустаяСсылка());
	СтруктураРеквизитов.Вставить("ИсполнительныйЛист",                 Документы.ИсполнительныйЛист.ПустаяСсылка());
	СтруктураРеквизитов.Вставить("ПеречислениеВБюджет",                Ложь);
	СтруктураРеквизитов.Вставить("СтатусСоставителя",                  "");
	СтруктураРеквизитов.Вставить("ОчередностьПлатежа",                 "");
	СтруктураРеквизитов.Вставить("КодБК",                              "");
	СтруктураРеквизитов.Вставить("КодОКАТО",                           "");
	СтруктураРеквизитов.Вставить("ПоказательОснования",                "");
	СтруктураРеквизитов.Вставить("ПоказательПериода",                  "");
	СтруктураРеквизитов.Вставить("ПоказательНомера",                   "");
	СтруктураРеквизитов.Вставить("ПоказательДаты",                     "");
	СтруктураРеквизитов.Вставить("НазначениеПлатежа",                  "");
	СтруктураРеквизитов.Вставить("ИдентификаторПлатежа",               "");
	СтруктураРеквизитов.Вставить("НастройкиЗаданы",                    Ложь);
	СтруктураРеквизитов.Вставить("ПеречислениеПоИсполнительномуЛисту", Истина);
	
	Возврат СтруктураРеквизитов;
	
КонецФункции

Процедура ЗаписатьРеквизитыПеречисленияПоИсполнительномуЛистуРаботника(РеквизитыПеречисления) Экспорт
	
	Если НЕ ЗначениеЗаполнено(РеквизитыПеречисления.Организация)
		ИЛИ НЕ ЗначениеЗаполнено(РеквизитыПеречисления.Сотрудник)
		ИЛИ НЕ ЗначениеЗаполнено(РеквизитыПеречисления.ИсполнительныйЛист) Тогда
		Возврат;
	КонецЕсли;
	
	МенеджерЗаписи = РегистрыСведений.РеквизитыПеречисленийПоИсполнительнымЛистам.СоздатьМенеджерЗаписи();
	ЗаполнитьЗначенияСвойств(МенеджерЗаписи, РеквизитыПеречисления);
	
	НазначениеПлатежа = РеквизитыПеречисления.НазначениеПлатежа;
	Если ЗначениеЗаполнено(НазначениеПлатежа) Тогда
		
		НазначениеПлатежа = СтрПолучитьСтроку(НазначениеПлатежа, 1);
		
		ПозицияСумма      = Найти(НазначениеПлатежа, "Сумма");
		НазначениеПлатежа = ?(ПозицияСумма = 0, НазначениеПлатежа, Лев(НазначениеПлатежа, ПозицияСумма - 1));
		
		МенеджерЗаписи.НазначениеПлатежа = СокрЛП(НазначениеПлатежа);
		
	КонецЕсли;
	
	МенеджерЗаписи.Записать();
	
КонецПроцедуры

Функция РеквизитыПеречисленияПоИсполнительномуЛистуРаботника(Организация,
															 Сотрудник,
															 ИсполнительныйЛист,
															 ДатаСреза = Неопределено) Экспорт
	
	РеквизитыПолучателяПлатежа = СтруктураРеквизитов();
	
	Если НЕ ЗначениеЗаполнено(Организация)
		ИЛИ НЕ ЗначениеЗаполнено(Сотрудник)
		ИЛИ НЕ ЗначениеЗаполнено(ИсполнительныйЛист) Тогда
		Возврат РеквизитыПолучателяПлатежа;
	КонецЕсли;
	
	МенеджерЗаписи = РегистрыСведений.РеквизитыПеречисленийПоИсполнительнымЛистам.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Организация        = Организация;
	МенеджерЗаписи.Сотрудник          = Сотрудник;
	МенеджерЗаписи.ИсполнительныйЛист = ИсполнительныйЛист;
	МенеджерЗаписи.Прочитать();
	
	НастройкиЗаданы = МенеджерЗаписи.Выбран();
	
	ЗаполнитьЗначенияСвойств(РеквизитыПолучателяПлатежа, МенеджерЗаписи);
	РеквизитыПолучателяПлатежа.Вставить("НастройкиЗаданы", НастройкиЗаданы);
	Если Не НастройкиЗаданы Тогда
		АвтоРеквизиты = ПоказателиПоУмолчанию(Сотрудник, ИсполнительныйЛист, ДатаСреза);
		ЗаполнитьЗначенияСвойств(РеквизитыПолучателяПлатежа, АвтоРеквизиты);
	КонецЕсли;
	
	Возврат РеквизитыПолучателяПлатежа;
	
КонецФункции

Функция ПолучитьНазначениеПлатежа(Организация, Сотрудник, ИсполнительныйЛист) Экспорт
	
	МенеджерЗаписи = РегистрыСведений.РеквизитыПеречисленийПоИсполнительнымЛистам.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Организация        = Организация;
	МенеджерЗаписи.Сотрудник          = Сотрудник;
	МенеджерЗаписи.ИсполнительныйЛист = ИсполнительныйЛист;
	МенеджерЗаписи.Прочитать();
	
	Возврат МенеджерЗаписи.НазначениеПлатежа;
	
КонецФункции

Функция СформироватьНазначениеПлатежа(Сотрудник, ИсполнительныйЛист, ДатаСреза = Неопределено) Экспорт
	
	ТекстПолучатель = "";
	
	Если ДатаСреза = Неопределено Тогда
		ДатаСреза = ТекущаяДатаСеанса();
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Сотрудник) Тогда
		
		ДанныеАвтореквизитов = УчетЗарплаты.ДанныеФизическогоЛицаДляИсполнительногоЛиста(Сотрудник, ДатаСреза);
		ТекстНазначения = ПолучитьТекстНазначениеПлатежа(ДанныеАвтореквизитов.ТекстПолучатель, ИсполнительныйЛист);
		
	КонецЕсли;
	
	Возврат ТекстНазначения;
	
КонецФункции

Функция РеквизитыЗаполнены(Организация, Сотрудник, ИсполнительныйЛист) Экспорт
	
	МенеджерЗаписи = РегистрыСведений.РеквизитыПеречисленийПоИсполнительнымЛистам.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Организация        = Организация;
	МенеджерЗаписи.Сотрудник          = Сотрудник;
	МенеджерЗаписи.ИсполнительныйЛист = ИсполнительныйЛист;
	МенеджерЗаписи.Прочитать();
	
	Возврат МенеджерЗаписи.Выбран();
	
КонецФункции

Процедура СинхронизироватьЗапись(Организация, Сотрудник, ИсполнительныйЛист) Экспорт
	
	Если РеквизитыЗаполнены(Организация, Сотрудник, ИсполнительныйЛист) Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	НаборЗаписей = РегистрыСведений.РеквизитыПеречисленийПоИсполнительнымЛистам.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.ИсполнительныйЛист.Установить(ИсполнительныйЛист);
	
	НаборЗаписей.Прочитать();
	
	Если НаборЗаписей.Количество() <> 0 Тогда
		Запись = НаборЗаписей[0];
		Запись.Организация        = Организация;
		Запись.Сотрудник          = Сотрудник;
		Запись.ИсполнительныйЛист = ИсполнительныйЛист;
		НаборЗаписей.Записать();
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПолучитьТекстНазначениеПлатежа(ТекстПолучатель, ИсполнительныйЛист)
	
	ТекстНазначения = "";
	
	Если ЗначениеЗаполнено(ИсполнительныйЛист) Тогда
		РеквизитыИсполнительногоЛиста = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ИсполнительныйЛист, "Дата, Номер");
		ТекстНазначения = СтрШаблон(НСтр("ru = '%1. Исполнительное производство №%2 от %3 г.'"), ТекстПолучатель,
		РеквизитыИсполнительногоЛиста.Номер,
		Формат(РеквизитыИсполнительногоЛиста.Дата, "ДФ=dd.MM.yyyy"));
	Иначе
		ТекстНазначения = ТекстПолучатель;
	КонецЕсли;
	
	Возврат ТекстНазначения;
	
КонецФункции

Функция ПоказателиПоУмолчанию(Сотрудник, ИсполнительныйЛист, ДатаСреза = Неопределено)
	
	РеквизитыПолучателяПлатежа = СтруктураРеквизитов();
	
	Если НЕ ЗначениеЗаполнено(Сотрудник)
		ИЛИ НЕ ЗначениеЗаполнено(ИсполнительныйЛист) Тогда
		Возврат РеквизитыПолучателяПлатежа;
	КонецЕсли;
	
	Если ДатаСреза = Неопределено Тогда
		ДатаСреза = ТекущаяДатаСеанса();
	КонецЕсли;
	
	ДанныеАвтореквизитов = УчетЗарплаты.ДанныеФизическогоЛицаДляИсполнительногоЛиста(Сотрудник, ДатаСреза);
	СтатусСоставителя    = ПлатежиВБюджетКлиентСервер.НезаполненноеЗначение();
	ПоказательОснования  = ПлатежиВБюджетКлиентСервер.НезаполненноеЗначение();
	
	Получатель = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ИсполнительныйЛист, "Получатель");
	Если ЗначениеЗаполнено(Получатель) Тогда
		ГоловнойКонтрагент = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Получатель, "ГоловнойКонтрагент");
		СведенияОПолучателе = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ГоловнойКонтрагент, "ГосударственныйОрган, ВидГосударственногоОргана");
		Если СведенияОПолучателе.ГосударственныйОрган Тогда
			СтатусСоставителя = ПлатежиВБюджетКлиентСервер.СтатусПлательщикаПоИсполнительномуЛисту();
			Если СведенияОПолучателе.ВидГосударственногоОргана = Перечисления.ВидыГосударственныхОрганов.НалоговыйОрган Тогда
				ПлатежиВБюджетКлиентСервер.ЭтоДобровольноеПогашениеЗадолженности(ПоказательОснования);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	РеквизитыПолучателяПлатежа.НазначениеПлатежа   = ПолучитьТекстНазначениеПлатежа(ДанныеАвтореквизитов.ТекстПолучатель, ИсполнительныйЛист);
	РеквизитыПолучателяПлатежа.ПоказательНомера    = ДанныеАвтореквизитов.ПоказательНомера;
	РеквизитыПолучателяПлатежа.СтатусСоставителя   = СтатусСоставителя;
	РеквизитыПолучателяПлатежа.ПоказательОснования = ПоказательОснования;
	РеквизитыПолучателяПлатежа.ОчередностьПлатежа  = УчетДенежныхСредствКлиентСервер.ОчередностьПлатежаПоИсполнительномуЛисту();
	
	Возврат РеквизитыПолучателяПлатежа;
	
КонецФункции

#КонецОбласти

#КонецЕсли
